Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: What do you think I am?
ru: Кто, ты думаешь, я такой?

source: I' m not gonna kill someone for money.
ru: Я не убиваю людей за деньги.

source: What, then?
ru: А за что тогда?

source: Love?
ru: За любовь?

source: What would you kill for?
ru: За что ты убьёшь его?

source: - You' d kill for your wife, wouldn' t you?
ru: - За свою жену ты убил бы, правда?

source: - That' s different.
ru: - Это разные вещи.

source: - Not to me, I wasn' t married to her!
ru: Мне без разницы, она была не моей женой!

source: - Hey, don' t talk about my wife.
ru: Эй, не говори так о моей жене.

source: I can talk about whoever the fuck I want!
ru: Я могу говорить что угодно и о ком угодно!

source: I can say whatever I want and you won' t remember!
ru: Я могу говорить всё что я захочу, и ты всё забудешь!

source: I can call your wife a fucking whore and we can still be friends.
ru: Я могу назвать твою жену шлюхой, и мы всё равно останемся друзьями!

source: - You can' t get scared!
ru: - Тебя ничем не испугать!

source: You don' t know how, you fucking idiot!
ru: Ты даже не знаешь, что такое страх, чёртов кретин!

source: This has nothing to do with me.
ru: Это всё никак со мной не связано.

source: How the fuck would you know?
ru: Откуда ты знаешь?

source: You don' t know a fucking thing!
ru: Ты не помнишь ни хрена, так откуда тебе это знать?

source: - Hey, can you get angry?
ru: - Но ты ведь можешь разозлиться?

source: You pathetic piece of shit!
ru: Ты трогательный кусок дерьма!

source: I can say whatever the fuck I want and you won' t have a clue, you fucking retard!
ru: Я могу сказать всё что я хочу, ты всё равно всё забудешь, ты, жертва аборта!

source: I' m gonna use you.
ru: Теперь я буду тебя использовать.

source: I' m telling you now because I' m gonna enjoy it much more..... if I know that you could stop me if you weren' t such a fucking freak.
ru: Я тебе говорю потому, что мне будет веселее, если я буду знать, что ты мог бы прекратить это, если бы не был таким дебилом.

source: Did you lose your pen?
ru: Что, потерял ручку?

source: Too bad, freak.
ru: Да, дело дрянь, ублюдок.

source: Otherwise you could write yourself a note about how much Natalie hates your guts..... and that I called your wife a whore!
ru: Иначе бы ты накорябал себе записку о том, как Натали ненавидит тебя...... и что назвала твою жену шлюхой!

source: - About your whore of a wife?
ru: - Больше ни слова, сука!

source: I read about your condition, Leonard.
ru: Я читала о твоей болезни, Леонард.

source: You know one of the causes of short- term memory loss?
ru: Ты знаешь, какова одна из причин потери короткой памяти?

source: Venereal disease.
ru: Венерические болезни.

source: Maybe your cunt of a fucking wife..... sucked one too many diseased cocks and turned you into a retard!
ru: Наверное, твоя потаскуха- жена...... сосала слишком много грязных членов, поэтому ты и стал уродом!

source: (softly) You sad, sad freak.
ru: Ты полный, безнадёжный кретин.

source: I can say whatever the fuck I want and you won' t remember.
ru: Я могу говорить всё что захочу, ты всё равно всё забудешь!

source: We' il still be best friends.
ru: И мы всё равно останемся друзьями.

source: I' il see you soon.
ru: Я скоро вернусь.

source: - (door opens and closes) - Stay focused.
ru: Сконцентрироваться.

source: Find a pen.
ru: Найти ручку.

source: I' m gonna write it down.
ru: Нужно всё это записать.

source: Concentrate, concentrate, concentrate.
ru: Сконцентрируйся, сконцентрируйся.

source: Keep it in mind, keep it in mind, keep it in mind.
ru: Держать в памяти, не забывать, не забывать.

source: I' ve got to find a pen.
ru: Найти ручку.

source: Now, write this down, write this down.
ru: Нужно записать, записать всё это.

source: Exactly what happened.
ru: Всё что здесь произошло.

source: I' m gonna write down what happened.
ru: Я должен записать, что произошло.

source: I' ve got to find a pen!
ru: Где эта чёртова ручка?

source: Come on, keep focused.
ru: Держать в памяти.

source: Keep focused.
ru: Держать в памяти.

source: Keep...
ru: Держать...

source: Come on, find a pen.
ru: Надо найти ручку.

source: Write this note.
ru: Написать записку.

source: What happened?
ru: Что случилось?

source: What does it look like?
ru: А на что это похоже?

source: He beat the shit out of me.
ru: Он избил меня.

source: - (knock at door) - Hello?
ru: Есть кто?

source: I know you said you didn' t want any calls but this guy on the phone says he' s a cop.
ru: Вы просили не соединять вас ни с кем, но там человек, говорит что он из полиции.

source: He says you' re really gonna wanna know what he has to say.
ru: Он говорит, что вам захочется услышать то, что он скажет.

source: I need to look people in the eye.
ru: Я должен смотреть человеку в глаза.

source: Well, what...
ru: Ну, что...

source: You can, um, you can crash on the couch.
ru: Можешь устроиться на диване.

source: It' s comfortable.
ru: Он очень удобный.

source: Just have a seat.
ru: Садись.

source: Hm?
ru: Итак, как долго, по- твоему, на это уйдёт времени?

source: You told me you were looking for the guy who killed your wife.
ru: Ты говорил мне, что ищешь человека, убившего твою жену.

source: Oh, it depends on if he' s here in town or if he' s moved on.
ru: О, это зависит от того, в городе он или уже уехал.

source: I have my file here.
ru: У меня тут документы...

source: Can I ask you something?
ru: Можно задать тебе один вопрос?

source: lf you have all that information, why haven' t the police found him for you?
ru: Если у тебя есть вся информация, почему полиция не нашла его?

source: - They' re not looking for him.
ru: - Потому что они не искали.

source: They don' t think he exists.
ru: Они уверены, что он не существует.

source: You see, I told them what I remembered.
ru: Видишь ли, я рассказал им, что помнил.

source: I was asleep.
ru: Я спал.

source: Something woke me up.
ru: Что- то меня разбудило.

source: Her side of the bed was cold.
ru: Её сторона постели была холодная.

source: She' d obviously been gone for a while.
ru: Она, видимо, встала зачем- то.

source: There had to be a second man.
ru: Там был ещё второй человек.

source: Somebody hit me from behind.
ru: Кто- то ударил меня сзади.

source: I remember.
ru: Я помню это.

source: It' s the last thing I do remember.
ru: Это последнее, что я помню.

source: Look, the police didn' t believe me.
ru: В полиции не поверили мне.

source: lf we check...
ru: Но здесь написано...

source: How did they explain what you do remember?
ru: Как же они объяснили всё это?

source: The gun and stuff?
ru: Пистолет и всё остальное?

source: John G was clever.
ru: Джон Г был ловкий человек.

source: He was clever.
ru: Да, он был ловкач.

source: He took the dead man' s gun and replaced it with the sap he hit me with.
ru: Он забрал у своего напарника пистолет, и вложил ему в руку то, чем ударил меня.

source: He left my gun and the getaway car.
ru: Он оставил мой пистолет и уехал.

source: He gave the police a complete package.
ru: Полиция обнаружила полный набор улик.

source: They found the sap with my blood on it in the dead man' s hand.
ru: Они нашли у трупа в руке предмет с моей кровью.

source: And they only found my gun.
ru: И мой пистолет на полу.

source: They didn' t need to look for anybody else.
ru: Им больше ничего не надо было искать.

source: I was the only guy who disagreed with the facts and I had brain damage.
ru: И у меня была травма головы.

source: You can stay here for a couple of days if it will help you.
ru: Ты можешь побыть здесь пару дней, если это тебе поможет.

source: Oh, thanks.
ru: Спасибо.

source: I have to go back to work, so, um, just make yourself at home.
ru: Мне нужно ехать на работу, так что чувствуй себя как дома.

source: You can watch TV or have some food.
ru: Можешь посмотреть телевизор, перекуси что- нибудь.

source: Whatever you want, OK?
ru: Делай что хочешь, ладно?

source: Make yourself at home.
ru: Не стесняйся.

source: One thing.
ru: Один момент.

source: - Something to remember you by.
ru: - На память.

source: - My name is Natalie.
ru: - Моё имя Натали.

source: My, you really do have a problem.
ru: Да, у тебя и вправду проблемы.

source: Just like that cop said.
ru: Как и говорил тот полицейский.

source: - Your condition.
ru: - Я про твоё заболевание.

source: Well, nobody' s perfect.
ru: У каждого свои недостатки.

source: What' s the last thing that you do remember?
ru: Что последнее ты помнишь?

source: - My wife.
ru: - Свою жену.

source: - That' s sweet.
ru: - Как мило.

source: Dying.
ru: Как она умирала.

source: I remember my wife dying.
ru: Я помню, как умирала моя жена.

source: Let me, um, get you another one.
ru: Подожди, сейчас принесу другую.

source: I think this one' s dusty.
ru: Эта пыльная.

source: Why are you calling me?
ru: Зачем вы мне звоните?

source: I know you' re a cop.
ru: Я знаю, вы из полиции.

source: Have I done something wrong?
ru: Я что, что- то натворил?

source: Look, why are you asking me?
ru: Что- нибудь плохое, наверное?

source: I can' t remember what I' ve done.
ru: Я не помню, что я делал.

source: You wouldn' t believe me anyway.
ru: Вы всё равно мне не поверите.

source: Because of my condition, you don' t believe someone with this condition.
ru: Вы не верите людям вроде меня.

source: Nobody believed Sammy!
ru: Никто не верил Сэмми!

source: I didn' t even fucking believe Sammy!
ru: Даже я не верил Сэмми!

source: Come by after.
ru: "Бар Ферди."

source: - A beer, please.
ru: - Пиво, пожалуйста.

source: A beer, please.
ru: Пиво, пожалуйста.

source: You can' t just waltz in here dressed like that and ask for a beer.
ru: Ты не можешь просто так вваливаться в такой одежде и заказывать пиво.

source: - What, is there a dress code?
ru: Здесь что, строгие правила насчёт одежды?

source: - Why are you here?
ru: Зачем пришёл?

source: - I' m meeting someone called Natalie.
ru: У меня тут встреча с дамой по имени Натали.

source: - Well, that' s me.
ru: Это я.

source: - Then why am I here?
ru: Мы ведь встречались раньше, верно?

source: - I don' t know, why don' t you tell me?
ru: - Я не знаю, ты мне это скажи.

source: I don' t remember.
ru: Я не помню.

source: Oh, you' re that memory guy.
ru: А, так ты тот самый парень с памятью.

source: - How do you know about me?
ru: - Как ты узнала про меня?

source: - My boyfriend told me about you.
ru: - Мой парень мне говорил о тебе.

source: Who' s your boyfriend?
ru: А кто твой парень?

source: - Jimmy Grants.
ru: - Джимми Грантс.

source: He knows you.
ru: А он тебя знает.

source: He told me about you.
ru: Он мне говорил о тебе.

source: He said you were staying at the Discount.
ru: Сказал, что ты остановился в "Дисконте".

source: ln fact, a cop came by earlier and was looking for you.
ru: И ещё, один полицейский приходил, спрашивал про тебя.

source: Said he was looking for a guy who can' t remember anything,..... wouldn' t know how he' d got here or what he' d done.
ru: Он говорил, что ищет парня, который ничего не помнит...... даже того, что сам сделал пять минут назад.

source: I get a lot of guys round here like that.
ru: Я сказала, что тут полным полно таких парней.

source: Chronic alcoholism is one cause of short- term memory loss.
ru: Хронический алкоголизм тоже иногда приводит к потере короткой памяти.

source: - Are you Teddy?
ru: - Ты Тедди?

source: - No, my name' s Leonard.
ru: - Нет, моё имя Леонард.

source: - I don' t know.
ru: - А кто тебя прислал, Тедди?

source: What' s happened to Jimmy?
ru: Что случилось с Джимми?

source: - I don' t know that, either.
ru: Прости.

source: - You don' t remember anything?
ru: - Значит, ты ничего не помнишь?

source: You don' t remember where you' ve been or what you' ve just done?
ru: Ты не помнишь, где ты был и и что делал?

source: I can' t make new memories.
ru: Я ничего не запоминаю.

source: Everything just fades.
ru: Память быстро угасает.

source: - I found this in my pocket.
ru: - Тогда зачем ты сюда пришёл?

source: Your pocket?
ru: У себя в кармане?

source: Bar bet.
ru: Пари.

source: Care to contribute?
ru: Плюнешь?

source: - No, thanks.
ru: - Нет, спасибо.

source: - It' s for a lot of money.
ru: Чтоб денег было больше.

source: Help me out.
ru: Выручка пойдёт на благотворительные цели.

source: (man laughs)
ru: - Спасибо.

source: It' s completely fucked because nobody believes you.
ru: Это как в заднице, никто не верит тебе.

source: It' s amazing what a little brain damage will do for your credibility.
ru: Поразительно, какой урон доверию может нанести одна небольшая травма.

source: I guess it' s poetic justice for not believing Sammy.
ru: Наверное, эта кара ниспослана мне за то, что я не верил Сэмми.

source: You know the truth about my condition, officer?
ru: Хотите знать правду о моём состоянии, офицер?

source: You don' t know anything.
ru: Я ничего не знаю.

source: You feel guilty, you have no idea why.
ru: Я злюсь, я чувствую вину, но не знаю почему.

source: You could do anything and not have the faintest idea ten minutes later.
ru: Я могу что- то делать, но через десять минут не могу вспомнить, зачем я это делаю.

source: Like Sammy.
ru: Как Сэмми.

source: What if I' d done something like Sammy?
ru: А что, если я что- то натворил, как Сэмми?

source: I didn' t tell you?
ru: Я не рассказывал вам?

source: What happened to Sammy and his wife?
ru: Что случилось с Сэмми и его женой?

source: She came to see me at my office.
ru: Она приходила ко мне в офис.

source: I didn' t tell her what I really thought but I never said that he was faking.
ru: Я не сказал ей правды, но я и не говорил ей, что он притворяется.

source: Just that his condition was mental, not physical.
ru: Просто его заболевание было психическим, а не физиологическим.

source: Sammy?
ru: Потом я узнал, что она пришла домой и устроила Сэмми последний экзамен.

source: She knew beyond a doubt that he loved her, so she found a way to test him.
ru: Она не сомневалась, что он любит её, и поэтому придумала такой способ проверить его.

source: Or shejust didn' t want to live with the things she' d put him through.
ru: Или просто не хотела жить, потеряв своего старого Сэмми.

source: It won' t hurt.
ru: Это не больно.

source: She went into a coma and never recovered.
ru: Она впала в кому, и умерла, не выходя из неё.

source: He doesn' t even know his wife is dead.
ru: Его поместили в клинику, и он скоро забыл, что у него умерла жена.

source: I was wrong about Sammy and I was wrong about his wife.
ru: Я был неправ в отношении Сэмми, и я был неправ в отношении его жены.

source: She wasn' t interested in the money.
ru: Ей не нужны были деньги.

source: She needed to understand his problem.
ru: Просто она хотела понять его проблему.

source: His brain didn' t respond to conditioning but he wasn' t a con man.
ru: Его сознание не приспосабливалось к окружению, но он не был симулянтом.

source: And when she looked into his eyes, she thought he could be the same person.
ru: Когда она смотрела в его глаза, она думала, что он тот же старый Сэмми.

source: When I looked into his eyes, I thought I saw recognition.
ru: Когда я смотрел в его глаза, мне казалось, он узнаёт меня.

source: Now I know you fake it.
ru: Теперь я знаю, что я ошибался.

source: lf you think you' re supposed to recognise somebody, you pretend to.
ru: Если бы ему нужно было узнать человека, он бы изобразил узнавание.

source: You bluff it to get a pat on the head from the doctors.
ru: Хотя бы для того, чтобы расположить к себе докторов.

source: You bluff it to seem less of a freak.
ru: Или чтобы не выглядеть кретином.

source: (tyres squeal)
ru: Какой наркоторговец?

source: - Hey, Lenny, how you doing?
ru: Как дела?

source: - It' s private back here.
ru: - Сюда нельзя заходить.

source: Right, kid?
ru: - Всё в порядке, мы с ним друзья.

source: - How did you know I was in here?
ru: - Как ты меня нашёл?

source: The Jag' s out front.
ru: Твой "Ягуар" стоит у входа.

source: What are you still doing here, Lenny?
ru: Как тебя сюда занесло, Ленни?

source: There' s plenty of tattoo parlours up north.
ru: На севере тату- салонов пруд пруди.

source: I guess I wanted to get something down before it slipped my mind.
ru: Я, кажется, хотел записать кое- что, пока не забыл.

source: - Give me the keys, I' il move it.
ru: - Дай мне ключи, я переставлю машину.

source: - It' il be all right.
ru: - Да ладно, бог с ней.

source: - Wait out there.
ru: - Подождите снаружи.

source: - Oh, for Christ...
ru: - О, ради бога...

source: Give me a minute, I' ve got to get something for you.
ru: Удели мне пару минут.

source: Fact six.
ru: "Факт 6:

source: Car licence SG13 7lU.
ru: Номер машины SG13 7IU "

source: Look, wait a minute, will ya?
ru: Вот вам, пожалуйста.

source: - We gotta get you out of here.
ru: - Нам нужно убираться отсюда.

source: Come on, Leonard.
ru: О, боже, Леонард!

source: How many times I gotta tell you?
ru: Сколько раз тебе объяснять?

source: - It' s not safe for you to hang around.
ru: - Тебе небезопасно торчать в городе.

source: Because that cop' s looking for you.
ru: Потому что тебя ищет полицейский.

source: I gotta get you a new identity,..... some new clothes, a different car would do for now.
ru: Я достал тебе новые документы,... кое- какую одежду, другую машину.

source: Put these on.
ru: Действуй, не тормози.

source: What cop?
ru: Какой полицейский?

source: He' s a bad cop.
ru: Это плохой полицейский.

source: He' s the one that checked you into the Discount lnn.
ru: Тот самый, что пас тебя в "Дисконте".

source: He' s been calling you for days, slipping envelopes under your door, shit like that.
ru: Который звонил тебе целыми днями, совал конверты под дверь и всё такое.

source: - How do you know this?
ru: Откуда ты всё это знаешь?

source: - He told me.
ru: Он мне рассказал.

source: He' s been laughing at you.
ru: Он думает, это весело.

source: - You' re full of shit.
ru: - Ты мне лапшу вешаешь на уши.

source: - No, I' m not.
ru: - Нет, я серьёзно.

source: He knows you' re no good on the phone so he' s been calling you up.
ru: Он знает, что ты не любишь говорить по телефону, вот и названивает тебе.

source: Jimmy Grants.
ru: А когда ты не берёшь трубку,... он подсовывает всякое дерьмо тебе под дверь, чтобы тебя напугать,... впаривает тебе о том, что Джон Г - это местный наркоторговец Джимми Грантс.

source: - Who' s Jimmy Grants?
ru: Кто такой Джимми Грантс?

source: - Leonard, Jimmy' s the drug dealer.
ru: Леонард, Джимми - местный наркоторговец.

source: The cop wants to know how his operation is run.
ru: Этот полицейский хочет быть в курсе операции.

source: He' s got some score in mind.
ru: Он тебя использует.

source: - Somehow you' re involved.
ru: - Не знаю как, но ты втянут в его дела.

source: - How do you know him?
ru: - Откуда ты его знаешь?

source: I' m a snitch.
ru: Я осведомитель.

source: He' s a cop from out of town.
ru: Он не из этого города.

source: The local boys put us together.
ru: Местные предпочитают держаться вместе.

source: lf he knew I was helping you, he' d fucking kill me.
ru: Если бы он узнал, что я помогаю тебе, он бы пристрелил меня.

source: So take these clothes, put them on and get the fuck out of here.
ru: В общем давай, переодевайся, и скорее убирайся из города.

source: Come on, Leonard, just go.
ru: Ну давай, Леонард, уезжай.

source: Ferdy' s bar.
ru: "Бар Ферди."

source: Hey, Jimmy.
ru: Привет, Джимми.

source: I' m sorry, I, uh, thought you were somebody else.
ru: Я обозналась.

source: This Jimmy Grants deals drugs out of the bar where his girlfriend works?
ru: Значит, этот Джимми Грантс продаёт наркотики прямо в баре своей подруги?

source: But he' s not going to bring her along?
ru: Но он почему- то не несёт ей новую партию.

source: He' il come by himself, right?
ru: Он ведь сам их привозит?

source: I always figured the drugs angle would be the best way to get him.
ru: Я полагаю, проще всего будет на него выйти через наркотики.

source: No, officer.
ru: Нет, офицер.

source: I' m as ready as I' il ever be.
ru: Я ко всему готов.

source: You' re in the lobby?
ru: Вы в вестибюле?

source: I' il be right there.
ru: Как вы выглядите?

source: Officer Gammell?
ru: Ленни!

source: - Hey, smile.
ru: - Улыбочку.

source: Not here.
ru: - О, не надо.

source: Over here.
ru: Вот здесь.

source: ls it Officer or Lieutenant Gammell?
ru: Как написать, офицер или лейтенант Гэммел?

source: Don' t write Gammell, just Teddy.
ru: Не пиши "Гэммел", напиши просто "Тедди".

source: - I' m undercover.
ru: - Я под прикрытием.

source: This is the directions, where he' s going.
ru: Вот места, где он обычно бывает.

source: - My number' s on the bottom if you...
ru: - И мой номер снизу, на всякий случай...

source: - You' re not coming?
ru: - Вы не едете?

source: Nah, it wouldn' t be appropriate.
ru: Нет, это было бы нежелательно.

source: Nice picture.
ru: Хороший снимок.

source: I look thin.
ru: Я на нём не такой толстый.

source: Make him beg.
ru: Эй, Ленни!

source: Hey, Teddy!
ru: Тедди!

source: Teddy!
ru: Тедди!

source: Jimmy.
ru: Джимми.

source: - What the fuck are you doing here?
ru: - Какого чёрта ты здесь делаешь?

source: - You Jimmy Grants?
ru: - Ты - Джимми Грантс?

source: Expecting any other Jimmys, memory man?
ru: А ты ожидал здесь увидеть какого- то другого Джимми, человек без памяти?

source: - Do you remember me?
ru: - Ты меня помнишь?

source: - Yeah, I remember you.
ru: - Да, я тебя помню.

source: Well?
ru: Где этот чёртов Тедди?

source: Motherfuck!
ru: Ублюдок!

source: Strip.
ru: Что ты делаешь?

source: - Strip!
ru: - Ты делаешь большую ошибку!

source: My associates are not the kind of people you wanna piss off.
ru: Мои компаньоны - не те люди, на которых можно так вот плевать.

source: Don' t say anything else.
ru: Больше ни слова.

source: - Take it off.
ru: - Я так и знал, что ему нельзя верить!

source: Your pants, too.
ru: И штаны тоже.

source: - I don' t wanna get blood on them.
ru: - Не хочу запачкать их кровью.

source: Did he tell you what I was bringing?
ru: Он тебе сказал, что я должен привезти?

source: - Take your fuckin 'pants off!
ru: - Снимай чёртовы штаны!

source: - I' ve got two hundred grand in the car!
ru: - У меня двести тысяч в машине!

source: - Just take it!
ru: - Снимай!

source: - You think you can bargain with me?
ru: - Давай договоримся по хорошему, а?

source: - Just take the money and walk away.
ru: - Забирай деньги и уходи.

source: - I don' t want your fucking money.
ru: - Мне не нужны твои чёртовы деньги.

source: Then, what?
ru: Что тогда?

source: - What do you want from me?
ru: - Что тебе нужно от меня?

source: - I want my fucking life back!
ru: - Мне нужна моя жизнь!

source: (softly) Sammy.
ru: Сэмми.

source: He said Sammy.
ru: Он сказал "Сэмми".

source: How does he know about Sammy?
ru: Откуда он знает про Сэмми?

source: Oh, fuck.
ru: О, чёрт.

source: Hey, mister!
ru: Что я наделал?

source: I need help!
ru: Мне нужна помощь!

source: There' s a guy in here, he' s hurt bad.
ru: Тут человек, он тяжело ранен.

source: We gotta get him to a doctor.
ru: Его нужно отвезти к врачу.

source: I don' t know what happened.
ru: Я не знаю, что произошло.

source: I' ve got this memory thing.
ru: У меня заболевание памяти.

source: - Do I know you?
ru: - Нет.

source: Don' t worry, I' m a cop.
ru: Не волнуйтесь, я полицейский.

source: - ls he still breathing?
ru: - Он ещё дышит?

source: - Well, I don' t know.
ru: Может быть.

source: - What the hell were you guys doing?
ru: - Как вас занесло в такую дыру?

source: - I don' t remember, I have this condition.
ru: У меня заболевание памяти.

source: - Ow!
ru: Надеюсь, всё не так серьёзно и этот парень жив.

source: That shit kills!
ru: Полегче с этой штукой!

source: - So you remember me now, huh?
ru: - Так ты помнишь меня, а?
